Revit 2026 API

# TransformMultiply Method

---

Multiplies this transformation by the specified transformation and returns the result.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Transform Multiply(
	Transform right
)
```
```vb
Public Function Multiply (
	right As Transform
) As Transform
```
```cpp
public:
Transform^ Multiply(
	Transform^ right
)
```
```fsharp
member Multiply :
        right : Transform -> Transform
```

#### Parameters

right Transform
    The specified transformation.

#### Return Value

TransformThe transformation equal to the composition of the two transformations.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when the handle of the specified transformation is . |

The combined transformation has the same effect as applying the right transformation first, and the left transformation, second. So, (T1(T2(p)) = (T1 * T2) (p).

#### Reference

Transform Class

Autodesk.Revit.DB Namespace